Repository: Battlesheep11/Rivo
Catalog: lib/core/localization/l10n/app_*.arb
Languages: he

source: Email
he: אימייל

source: Password
he: סיסמה

source: Sign In
he: התחברות

source: Signing In...
he: מתחבר...

source: Sign Up
he: הרשמה

source: Forgot Password?
he: שכחת סיסמה?

# authTermsAcceptanceRequired
source: Please accept the terms and conditions to continue
he: אנא אשר את תנאי השימוש כדי להמשיך

# authPasswordValidationRequired
source: Please enter a valid password and confirm it correctly
he: אנא הזן סיסמה תקפה ואשר אותה כראוי

# authTermsAndConditions
source: By creating an account, you agree to our {termsOfService} and {privacyPolicy}
he: על ידי יצירת חשבון, אתה מסכים ל{termsOfService} ול{privacyPolicy} שלנו

# authTermsOfService
source: Terms of Service
he: תנאי שימוש

# authPrivacyPolicy
source: Privacy Policy
he: מדיניות פרטיות

source: Post New Item
he: הוסף פריט חדש

# authWelcomeTitle
source: Welcome Back
he: ברוכה השבה

# authWelcomeSubtitle
source: Sign in to discover unique fashion
he: התחברי בכדיי לגלות את האופנה היחודית שלך

# authEmailHint
source: Enter your email
he: הכנס אימייל

# authSubheading
source: Join our fashion community
he: הצטרף לקהילת האופנה שלנו

# authFullName
source: Full Name
he: שם מלא

# authFullNameHint
source: Enter your full name
he: אנא הכנס שם מלא

# authUsername
source: Username
he: שם משתמש

# itemPublishedSuccessfully
source: Item Published!
he: הפריט הופס בהצלחה!

# yourItemHasBeenPublished
source: Your item has been published successfully and is now visible to the community.
he: הפריט שלך הופס בהצלחה והופך זמין לצפייה בקהילה.

# categoryLabel
source: Category
he: הכנס קטגוריה

# selectCategoryHint
source: Select category
he: בחר קטגוריה

source: Settings
he: הגדרות

source: Post Upload
he: העלאת פוסט

source: Post Upload Preferences
he: העדפות העלאת פוסט

# postUploadPreferencesSubtitle
source: Customize your post upload preferences
he: התאמה אישית של מה שקורה לאחר העלאת פוסט

source: Show Post Upload Dialog
he: הצג חלון הצלחה

# showPostUploadDialogSubtitle
source: Show a dialog after uploading a post
he: הצג חלון אישור לאחר העלאת פוסט

source: Auto-navigate to post
he: ניווט אוטומטי לפוסט

# autoNavigateToPostSubtitle
source: Automatically navigate to the post after upload
he: עבור אוטומטית לפוסט לאחר העלאה

# authUsernameHint
source: Choose a username
he: בחר שם משתמש

# authFirstName
source: First Name
he: שם פרטי

# authFirstNameHint
source: Enter your first name
he: הכנס שם פרטי

# authLastName
source: Last Name
he: שם משפחה

# authLastNameHint
source: Enter your last name
he: הכנס שם משפחה

# passwordStrengthWeak
source: Weak
he: חלש

# passwordStrengthMedium
source: Medium
he: בינוני

# passwordStrengthStrong
source: Strong
he: חזק

# passwordStrengthVeryStrong
source: Very Strong
he: חזק מאוד

# authContinue
source: Continue
he: המשך

# authCreatePassword
source: Create Password
he: צור סיסמה

# authSecureAccount
source: Secure your account
he: אבטח את המשתמש שלך

# authForgotPasswordTitle
source: Forgot Password?
he: שכחת סיסמה?

# authForgotPasswordSubtitle
source: Enter your email and we will send you a link to reset your password
he: הזן את האימייל שלך ונשלח לך קישור לאיפוס הסיסמה

# authResetPassword
source: Reset Password
he: אפס סיסמה

# resetPasswordMessage
source: Please enter your new password
he: אנא הזן את הסיסמה החדשה שלך

source: New Password
he: סיסמה חדשה

source: Confirm New Password
he: אשר סיסמה חדשה

# passwordResetSuccess
source: Your password has been reset successfully!
he: הסיסמה שלך אופסה בהצלחה!

# authResetEmailSent
source: Password reset email sent. Please check your inbox.
he: נשלח אימייל לאיפוס סיסמה. אנא בדוק את תיבת הדואר הנכנס שלך.

# authSendResetLink
source: Send Reset Link
he: שלח קישור לאיפוס

# emailValidationEmpty
source: Please enter your email
he: אנא הזן את כתובת האימייל שלך

# emailValidationInvalid
source: Please enter a valid email address
he: אנא הזן כתובת אימייל תקפה

# passwordValidationEmpty
source: Password cannot be empty
he: הסיסמה לא יכולה להיות ריקה

# passwordValidationMinLength
source: Password must be at least 8 characters long
he: הסיסמה חייבת להכיל לפחות 8 תווים

# passwordValidationUppercase
source: Password must contain at least one uppercase letter
he: הסיסמה חייבת להכיל לפחות אות גדולה אחת

# passwordValidationLowercase
source: Password must contain at least one lowercase letter
he: הסיסמה חייבת להכיל לפחות אות קטנה אחת

# passwordValidationNumber
source: Password must contain at least one number
he: הסיסמה חייבת להכיל לפחות מספר אחד

# passwordValidationSpecialChar
source: Password must contain at least one special character
he: הסיסמה חייבת להכיל לפחות תו מיוחד אחד

# authConfirmPassword
source: Confirm Password
he: אשר את הסיסמה

# authConfirmPasswordHint
source: Confirm your password
he: אשר את סיסמתך

# authPasswordHint
source: Enter your password
he: הכנס סיסמה

# authOrContinueWith
source: or continue with
he: המשך עם

# authInvalidCredentials
source: Email\Password are incorrect or nonexistant. please try again.
he: כתובת אימייל או סיסמה שגויים או שאינם קיימים. אנא נסה שוב.

# authCreateAccount
source: Create Account
he: צור חשבון

# authTermsAccept
source: I accept the
he: אני מקבל

# authSignUpQuestion
source: Don't have an account?
he: אין לך משתמש?

# authSignUpLink
source: Sign up
he: להרשמה

# authSignInQuestion
source: Already have an account?
he: כבר יש לך משתמש?

# authSignInLink
source: Sign In
he: התחבר

# continueWithGoogleText
source: Continue with Google
he: המשך עם Google

# logoText
source: RIVO
he: ריבו

# authSigningUp
source: Signing Up...
he: נרשם...

# authSignupValidationMessage
source: Please fill all fields correctly to enable signup
he: אנא מלא את כל השדות כראוי כדי להפעיל את ההרשמה

# passwordValidationTooShort
source: Password must be at least 6 characters
he: הסיסמה חייבת לכלול לפחות 6 תווים

# authConfirmPasswordMismatch
source: Passwords do not match
he: הסיסמאות אינן תואמות

# uploadRequiredFieldsMissing
source: Please complete all required fields.
he: אנא השלם את כל השדות הנדרשים.

# uploadUnexpectedError
source: Something went wrong. Please try again.
he: משהו השתבש. אנא נסה שוב.

source: Upload Post
he: פרסם פוסט

source: Upload
he: העלאה

source: Title
he: כותרת

source: Description
he: תיאור

# authUsernameTaken
source: Username is already taken. Please choose another.
he: שם משתמש תפוס

# authEmailTaken
source: Email is already registered. Please log in or use a different email.
he: כתובת אימייל תפוסה

source: More from this seller
he: עוד מוכרים

# uploadCaptionLabel
source: Caption
he: כיתוב

# uploadCaptionHint
source: Enter a caption for your post
he: הזן כיתוב לפוסט שלך

# uploadPriceLabel
source: Price
he: מחיר

# uploadPriceHint
source: Enter a price
he: הזן מחיר

# uploadBackButton
source: Back
he: חזור

# uploadNextButton
source: Next
he: הבא

# itemDetailsLabel
source: Item Details
he: פרטי פריט

source: New Item
he: פריט חדש

source: Add photos
he: הוסף תמונות

# photoTip
source: First photo is your cover image. Tap to rearrange.
he: התמונה הראשונה היא תמונת השער. הקש כדי לסדר מחדש.

source: What are you selling?
he: מה אתה מוכר?

source: Details
he: פרטים

source: Publish Item
he: פרסם פריט

# settingsTooltip
source: Settings
he: הגדרות

# settingsPostUpload
source: Post Upload
he: העלאת פוסט

# settingsPostUploadDescription
source: Customize what happens after you upload a post
he: התאמה אישית של מה שקורה לאחר העלאת פוסט

# settingsShowPostUploadDialog
source: Show success dialog
he: הצג חלון הצלחה

# settingsShowPostUploadDialogDescription
source: Show a confirmation dialog after uploading a post
he: הצג חלון אישור לאחר העלאת פוסט

# settingsAutoNavigateToPost
source: Auto-navigate to post
he: ניווט אוטומטי לפוסט

# settingsAutoNavigateToPostDescription
source: Automatically go to the post after uploading
he: עבור אוטומטית לפוסט לאחר העלאה

source: Post-upload preferences updated.
he: העדפות העלאת הפוסט עודכנו

source: Followers
he: עוקבים

source: Following
he: נעקבים

# passwordValidationInvalid
source: Password is invalid
he: סיסמה שגויה

# passwordValidationMismatch
source: Passwords do not match
he: הסיסמאות אינן תואמות

# passwordValidationRequired
source: Password is required
he: סיסמה שגויה

source: No bio yet.
he: אין ביוגרפיה עדיין.

source: Edit Bio
he: ערוך ביוגרפיה

# noTagsYet
source: No tags yet. Add some!
he: אין עדיין תגים. הוסף כמה!

source: Edit Tags
he: ערוך תגיות

source: Cancel
he: ביטול

source: Save
he: שמור

# failedToUpdateBio
source: Failed to update bio. Please try again.
he: נכשל עדכון הביוגרפיה. נסה שוב.

# bioHint
source: Enter your bio (max 500 characters)
he: הכנס ביוגרפיה (עד 500 תווים)

# charactersLeft
source: {count} characters left
he: נותרו {count} תווים

source: Logout
he: התנתקות

source: Price
he: מחיר

source: Chest
he: חזה

source: Waist
he: מותן

source: Length
he: אורך

source: Caption
he: כיתוב

source: Category
he: קטגוריה

# selectCategory
source: Select a category
he: בחר קטגוריה

source: Tags
he: תגיות

# fieldRequired
source: This field is required
he: שדה חובה

# uploadCaptionRequired
source: Caption is required
he: יש להוסיף כיתוב

# uploadCaptionRequiredBackend
source: Caption is required
he: יש להוסיף כיתוב

# uploadPriceRequired
source: Price is required
he: יש להוסיף מחיר

# uploadPriceRequiredBackend
source: Price is required
he: יש להוסיף מחיר

# uploadPhotoRequired
source: Please add at least one photo
he: אנא הוסף לפחות תמונה אחת

# uploadCategoryRequired
source: Please select a category
he: אנא בחר קטגוריה

# chestMeasurementLabel
source: Chest measurements
he: מידות חזה

# waistMeasurementLabel
source: Waist measurements
he: מידות מותן

# lengthMeasurementLabel
source: Length measurements
he: מידות אורך

# captionLabel
source: Caption for post
he: טקסט שמצורף לפוסט

source: Error loading data
he: שגיאה בטעינת הנתונים

source: Tag already selected
he: התגית כבר נבחרה

# onboardingWelcomeTitle
source: Welcome to RIVO
he: ברוכה הבאה ל־RIVO

# onboardingWelcomeSubtitle
source: Your feed will be personalized based on what you love. Let's choose a few topics together.
he: הפיד שלך יתבסס על מה שאת אוהבת. בואי נבחר יחד כמה נושאים שמעניינים אותך.

# onboardingStartButton
source: Let's choose tags
he: יאללה, נבחר תגיות

# onboardingTagSelectionPlaceholder
source: TODO: Tag selection UI
he: TODO: מסך בחירת תגיות

# tagSelectorHint
source: Add a tag...
he: הוסיפי תגית...

# onboardingTagSelectionTitle
source: What do you love to see?
he: מה את אוהבת לראות?

# onboardingFinishButton
source: Finish
he: סיום

# tagVintage
source: Vintage
he: וינטג'

# tagMinimalism
source: Minimalism
he: מינימליזם

# tagStreetwear
source: Streetwear
he: סטריטוור

# tagUrban
source: Urban
he: אורבני

# tagSecondhand
source: Secondhand
he: יד שנייה

# tagSustainable
source: Sustainable
he: בר קיימא

# tagColorful
source: Colorful
he: צבעוני

# tagRetro
source: Retro
he: רטרו

# tagOversized
source: Oversized
he: אוברסייז

# tagClean
source: Clean
he: נקי

# tagEthical
source: Ethical
he: אתי

# tagHandmade
source: Handmade
he: תוצרת יד

# tagFestival
source: Festival
he: פסטיבלים

# tagSchool
source: School
he: לבית ספר

# tagOffice
source: Office
he: למשרד

# tagDateNight
source: Date Night
he: לדייט

# tagLocalBrands
source: Local Brands
he: מותגים מקומיים

# mediaPickerUpload
source: Upload
he: העלאה

# mediaPickerUploading
source: Uploading...
he: מעלה...

# mediaPickerFailed
source: Failed to upload media
he: נכשל בהעלאת מדיה

source: Pick of the Day
he: בחירת היום

# explore
source: Explore Today's Pick
he: גלה את הבחירות של היום

source: Discover
he: דיסקבר

source: Curated For You
he: נוצר עבורך

source: Trending Now
he: טרנדי עכשיו

source: items
he: פריטים

# searchTitle
source: Search
he: חיפוש

# searchHint
source: Search products, tags, or sellers
he: חיפוש מוצרים, תגיות או מוכרים

# searchResults
source: Results
he: תוצאות

source: Filter
he: סנן

# searchEmptyResults
source: Start by searching for something you love
he: יאללה לחפש משהו שאוהבים

# tabProducts
source: Products
he: מוצרים

# tabUsers
source: Users
he: משתמשים

# tabTags
source: Tags
he: תגיות

# searchNoResults
source: No matching products found.
he: לא נמצאו תוצאות

# searchTooltip
source: Search
he: חיפוש

# curatedCollectionsTitle
source: Featured Collections
he: אוספים מומלצים

source: Popular Sellers
he: מוכרים פופולריים

# recommendedSellersTitle
source: Top Sellers
he: מוכרים מומלצים

# noMatchingSellers
source: No matching sellers found
he: לא נמצאו מוכרים מתאימים

# errorOccurred
source: An error occurred:
he: אירעה שגיאה:

# noMatchingTags
source: No matching tags found
he: לא נמצאו תגיות מתאימות

# mediaPickerCamera
source: Camera
he: צלם

# mediaPickerGallery
source: Gallery
he: גלריה

source: Next
he: הבא

source: No media found in gallery
he: לא נמצאו מדיה בגלריה

source: Take Photo
he: צלם תמונות

source: Record Video
he: צלם וידאו

source: Select Media
he: בחר מדיה

source: Confirm
he: אישור

# uploadProgressLabel
source: {uploaded} of {total} media files uploaded
he: הועלו {uploaded} מתוך {total} קבצי מדיה

# uploadingMedia
source: Uploading media files
he: מעלה מדיה

# uploadSuccess
source: Post uploaded successfully!
he: הפוסט הועלה בהצלחה!

# uploadFailure
source: Something went wrong. Please try again.
he: משהו השתבש. נסו שוב.

# firstPhotoAsCover
source: Your first photo will be the cover of your item.
he: התמונה הראשונה תשמש כתמונת שער

# permissionDialogCancel
source: Cancel
he: ביטול

# permissionDialogOpenSettings
source: Open Settings
he: פתח הגדרות

# cameraPermissionTitle
source: Camera permission required
he: נדרשת הרשאה לצלם

source: Cover
he: שער

# cameraPermissionMessage
source: To take photos or videos, camera access is required. You can enable it from settings.
he: ללא הרשאה לצלם, לא תוכל להעלות תמונות או וידאו.

# galleryPermissionTitle
source: Gallery permission required
he: נדרשת הרשאה לגלריה

# galleryPermissionMessage
source: To pick media from your gallery, photo access is required. You can enable it from settings.
he: כדי לבחור תמונה מהגלריה, נדרשת הרשאה. אפשר לאפשר אותה דרך ההגדרות.

# feedError
source: Error: {error}
he: תקלה: {error}

source: Retry
he: נסה בשנית

source: No posts available
he: אין פוסטים זמינים

# placeholderScreenTitle
source: {title} Screen
he: {title} מסך

# navBarHome
source: Feed
he: בית

# navBarSearch
source: Search
he: גילוי

# navBarFavorites
source: Favorites
he: מועדפים

# navBarProfile
source: Profile
he: פרופיל

source: Error loading tags
he: שגיאה בטעינת תגיות

# failed_to_publish_item
source: Failed to publish item: {error}
he: פרסום הפריט נכשל: {error}

source: Item Published!
he: הפריט פורסם!

# item_published_description
source: Your item is now live. What would you like to do next?
he: הפריט שלך עלה לאוויר. מה תרצה/י לעשות עכשיו?

source: Go Home
he: לדף הבית

# captionAndPriceTitle
source: Caption & Price
he: כיתוב ומחיר

# addCaptionHint
source: Add a caption
he: הוסף כיתוב

# itemDetailsTitle
source: Item Details
he: פרטי הפריט

# conditionLabel
source: Condition
he: מצב

# selectConditionHint
source: Select condition
he: בחר מצב

# sizeLabel
source: Size
he: מידה

# selectSizeHint
source: Select size
he: בחר מידה

# brandLabel
source: Brand
he: מותג

# enterBrandHint
source: Enter brand
he: הזן מותג

# materialLabel
source: Material
he: חומר

# enterMaterialHint
source: Enter material
he: הזן חומר

# tagsAndStyleTitle
source: Tags & Style
he: תגיות וסגנון

# tagsDescription
source: Add style tags to help buyers find your item
he: הוסף תגיות סגנון שיעזרו לקונים למצוא את הפריט שלך

# customTagsHint
source: Add your own tags (comma separated)
he: למשל: קיץ, מסיבה, נוח

# styleTagsLabel
source: Style Tags
he: תגיות סגנון

# customTagsLabel
source: Custom Tags
he: תגיות מותאמות אישית

# selectedTagsLabel
source: Selected Tags
he: תגיות נבחרות

# publishItemButton
source: Publish Item
he: פרסם פריט

# publishingButton
source: Publishing...
he: מפרסם...

# centimetersAbbreviation
source: cm
he: ס״מ

source: Item Published!
he: הפריט פורסם!

# itemPublishedDescription
source: Your item has been successfully published and is now visible to other users.
he: הפריט שלך פורסם בהצלחה ונראה כעת למשתמשים אחרים.

source: Go Home
he: לדף הבית

source: View Item
he: צפה בפריט

# failedToPublish
source: Failed to publish item: {error}
he: שגיאה בפרסום הפריט: {error}

source: View Item
he: צפה/י בפריט

# custom_tags_hint
source: e.g. summer, party, comfortable
he: לדוגמה: קיץ, מסיבה, נוח

# signInToAccessSettings
source: Please sign in to access settings
he: אנא התחבר כדי לגשת להגדרות

# conditionGood
source: Good
he: מצב טוב

# conditionFair
source: Fair
he: מצב בינוני

# publishButton
source: Publish
he: פרסם

# maxPhotosError
source: Maximum 10 photos allowed
he: אפשרי מקסימום 10 תמונות

# savePhotoError
source: Failed to save photo
he: שגיאה בשמירת תמונה

# selectConditionTitle
source: Select Condition
he: בחר מצב

# conditionNewWithTags
source: New with tags
he: חדש עם תגיות

# conditionNewWithoutTags
source: New without tags
he: חדש בלי תגיות

# conditionLikeNew
source: Like new
he: נוסף

# conditionVeryGood
source: Very good
he: מצב מאוד טוב

source: Optional
he: אופציונלי

# itemDetailsDescription
source: Add details about your item to help buyers find it.
he: פרטי הפריט

# measurementsLabel
source: Measurements
he: מידות

# tagsAndStyleDescription
source: Add tags to help people find your item
he: הוסף תגיות סגנון שיעזרו לקונים למצוא את הפריט שלך
